Documents/УстановкаУсловийПребывания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаУсловийПребывания</Name>
			<Comment>Установка условий пребывания в стационаре</Comment>
			<BasedOn>
				<xr:Item>Document.ОбращениеВСтационар</xr:Item>
				<xr:Item>Document.БронированиеКойкоМеста</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияПребывания</xr:Item>
				<xr:Item>InformationRegister.омг_ТекущиеМедицинскиеКарты</xr:Item>
				<xr:Item>InformationRegister.СостояниеКойкоМеста</xr:Item>
				<xr:Item>InformationRegister.КлиентыСтационара</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженияВСтационаре</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Палата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Палаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОбращения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбращениеВСтационар</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Полис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраховыеПолисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КойкоМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КлиентыСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КлиентыСтационара</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КойкоМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаУсловийПребывания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДвиженияВСтационаре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыДвиженияВСтационаре</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеУсловий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводМеждуПодразделениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выписка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УстановкаУсловийПребывания/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма, Ложь);
	УстановитьПодменюВыбораОпераций();
	
	НастроитьВидимостьЭлементов();
	НастроитьПодразделениеПоВидуДокумента();
	
	Если Объект.Ссылка.Пустая() Тогда 
		КалендарьПланирования.ОкруглитьВремяДоПериодаПланирования(Объект.ДатаНачала);
	КонецЕсли;
	
	Объект.ДатаНачала = ОпределитьДатуНачалаДействия(Объект.ДатаНачала, Объект.Дата, Объект.ДокументОбращения);
	
	ДатаС = Объект.ДатаНачала;
	ВремяС = Объект.ДатаНачала;
	ДатаПо = Объект.ДатаОкончания;
	ВремяПо = Объект.ДатаОкончания;
	
	ВремяОкончанияПоУмолчанию = УправлениеНастройкамиМедицинскогоУчета.ПолучитьПараметрУчетнойПолитики("ВремяВыпискиДляБронированияПоУмолчанию");
	
	Элементы.КойкоМесто.СписокВыбора.ЗагрузитьЗначения(Стационар.КойкиПалаты(Объект.Палата));
	
	Элементы.ФормаЗаполнитьПоПредыдущему.Доступность = Объект.ВидОперации <> Перечисления.ВидыДвиженияВСтационаре.Выписка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьПолисаПрейскуранта();
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДвиженияВСтационаре.Выписка") Тогда
		Объект.Подразделение 	= ПредопределенноеЗначение("Справочник.Подразделения.ПустаяСсылка");
		Объект.Палата 			= ПредопределенноеЗначение("Справочник.Палаты.ПустаяСсылка");
		Объект.КойкоМесто	 	= ПредопределенноеЗначение("Справочник.КойкоМеста.ПустаяСсылка");
		Объект.ДатаОкончания	= Дата(1,1,1);
		Объект.Полис			= ПредопределенноеЗначение("Справочник.СтраховыеПолисы.ПустаяСсылка");
	КонецЕсли;
	
	Объект.ДатаНачала = ДатаС + (ВремяС - Дата(1,1,1));
	Объект.ДатаОкончания = ДатаПо + (ВремяПо - Дата(1,1,1));
	
	Для Каждого эл Из Объект.Номенклатура Цикл 
		
		СтруктураПоиска = Новый Структура("Номенклатура");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, эл);
		
		Если Объект.Номенклатура.НайтиСтроки(СтруктураПоиска).Количество() > 1 Тогда
			Предупреждение("В документе есть дублирующаяся номенклатура!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) И  Объект.ДатаНачала >= Объект.ДатаОкончания Тогда 
		Предупреждение("Дата начала периода пребывания не может быть больше или равна дате окончания периода!");
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(ТекущийОбъект,,ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрыОповещения = Новый Структура("УстановкаУсловийПребывания, Обращение", Объект.Ссылка, Объект.ДокументОбращения);
	Оповестить("УстановкаУсловийПребывания", ПараметрыОповещения);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПоискКлиентов(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ФормаПоискаКлиентаУпр",,Элементы.Клиент);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ДИНАМИЧЕСКИ СОЗДАВАЕМЫХ КОМАНД.

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВывестиДвиженияДокумента(Команда)
	РаботаСДиалогамиКлиент.ВывестиДвиженияДокумента(Объект.Ссылка, Команда);
КонецПроцедуры

///////////////////////////////////////////////
// ЗАПОЛНЕНИЕ СПИСКА ОПЕРАЦИЙ

&НаСервере
Процедура УстановитьПодменюВыбораОпераций()
	
	МассивТипов = Перечисления.ВидыДвиженияВСтационаре.ПустаяСсылка().Метаданные().ЗначенияПеречисления;
	РаботаСДиалогамиСервер.УстановитьПодменюОперации(МассивТипов, ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ДействияФормыДействиеУстановитьОперацию(Команда)
	Если Команда <> Неопределено ТОгда
		ДействияФормыДействиеУстановитьОперациюСервер(Команда.Имя);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ДействияФормыДействиеУстановитьОперациюСервер(КомандаИмя)
	
	Если ЗначениеЗаполнено(КомандаИмя) Тогда 
		Объект.ВидОперации = Перечисления.ВидыДвиженияВСтационаре[КомандаИмя];
	КонецЕсли;
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(Объект, Истина, ЭтаФорма);
	
	НастроитьВидимостьЭлементов();
	НастроитьПодразделениеПоВидуДокумента(Истина);
	
КонецПроцедуры

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоВидуПалаты(Команда)
	
	Ответ = КодВозвратаДиалога.ОК;
	
	Если Объект.Номенклатура.Количество() > 0 Тогда 
		Ответ = Вопрос("Табличная часть будет очищена. Продолжить? ",РежимДиалогаВопрос.ОКОтмена, ,КодВозвратаДиалога.Отмена,"Заполнение услуг");
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		ЗаполнитьТарифыПоВидуПалатыНаКлиенте(Объект);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПредыдущему(Команда)
	
	Ответ = КодВозвратаДиалога.ОК;
	
	Если Не Объект.Ссылка.Пустая() Тогда 
		Ответ = Вопрос("Данные документа будут изменены! Продолжить? ",РежимДиалогаВопрос.ОКОтмена, ,КодВозвратаДиалога.Отмена,"Заполнение по предыдущему");
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		ЗаполнитьПоПредыдущемуНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПалатаПолучательПриИзменении(Элемент)
	
	Элементы.КойкоМесто.СписокВыбора.ЗагрузитьЗначения(Стационар.КойкиПалаты(Объект.Палата));
	
	Элементы.Подразделение.Доступность = Не ЗначениеЗаполнено(Объект.ДокументОбращения) И Не ЗначениеЗаполнено(Объект.Палата);
	
	Если Не Объект.Палата.Пустая()
		И Объект.Ссылка.Пустая()
	Тогда
		ЗаполнитьТарифыПоВидуПалатыНаКлиенте(Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КойкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.КойкоМеста.ФормаВыбора",Новый Структура("Дата, Подразделение, Регистратор, БлокироватьВыборЗанятых, Клиент", 
					Объект.ДатаНачала, Объект.Подразделение, Объект.Ссылка, Истина, Объект.Клиент),Элементы.КойкоМесто,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КойкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПодключитьОбработчикОжидания("КойкаОбработкаВыбораОбновитьПалату", 0.01, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КойкаОбработкаВыбораОбновитьПалату()
	
	Если ЗначениеЗаполнено(Объект.КойкоМесто) Тогда
		ВладельцыКойки = ПолучитьВладельцевКойки(Объект.КойкоМесто);
		
		ПалатаИзменилась = Объект.Палата <> ВладельцыКойки.Владелец;
		Объект.Палата = ВладельцыКойки.Владелец;
		Объект.Подразделение = ВладельцыКойки.Подразделение;
		
		Если ПалатаИзменилась Тогда
			ПалатаПолучательПриИзменении(Неопределено);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолисПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Полис) Тогда
		Объект.Прейскурант = Неопределено;
	КонецЕсли;
	УстановитьДоступностьПолисаПрейскуранта();
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	Если Объект.ДокументОбращения.Пустая() Тогда
		Объект.ДокументОбращения = ПолучитьТекущийДокументОбращенияКлиента(Объект.Клиент);
		ДокументОснованиеПриИзменении(Неопределено);
		Если Не Объект.ДокументОбращения.Пустая()
			И Не ЗначениеЗаполнено(Объект.ДатаНачала)
		Тогда
			Объект.ДатаНачала = ОпределитьДатуНачалаДействия(Объект.ДатаНачала, Объект.Дата, Объект.ДокументОбращения)
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДвиженияВСтационаре.ИзменениеУсловий") Тогда
		Объект.Подразделение = ПолучитьПодразделениеКлиента(Объект.Клиент, Объект.ДатаНачала);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПоПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(ВремяПо) Тогда
		ВремяПо = ВремяОкончанияПоУмолчанию;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВремяПоПриИзменении(Элемент)
	КалендарьПланирования.ОкруглитьВремяДоПериодаПланирования(ВремяПо);
КонецПроцедуры

&НаКлиенте
Процедура ВремяРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Имя элемента и имя реквизита должны совпадать.
	НовоеВремя = ЭтотОбъект[Элемент.Имя] + Направление * 3600;
	ЭтотОбъект[Элемент.Имя] = ?(Направление < 0 Или Час(НовоеВремя) > Час(ЭтотОбъект[Элемент.Имя]), НовоеВремя, ЭтотОбъект[Элемент.Имя]);
	
	Если Элемент.Имя = "ВремяС" Тогда
		ДатаВремяПриИзменении();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяСПриИзменении(Элемент)
	
	КалендарьПланирования.ОкруглитьВремяДоПериодаПланирования(ВремяС);
	ДатаВремяПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
	
	ДатаВремяПриИзменении()
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Подразделение)
		И ЗначениеЗаполнено(Объект.ДокументОбращения) 
	Тогда
		Объект.Подразделение = ДопСерверныеФункции.ПолучитьРеквизит(Объект.ДокументОбращения, "Подразделение");		
	КонецЕсли;
	Элементы.Подразделение.Доступность = Не ЗначениеЗаполнено(Объект.Подразделение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	Объект.КойкоМесто = Неопределено;
	Объект.Палата = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаСервере
Процедура НастроитьВидимостьЭлементов()
	
	Если Объект.ВидОперации = Перечисления.ВидыДвиженияВСтационаре.Выписка Тогда 
		Элементы.ГруппаПраво.Видимость	= Ложь;
		Элементы.ГруппаПалаты.Видимость = Ложь;
		Элементы.Номенклатура.Видимость = Ложь;
		Элементы.ВремяПо.Видимость = Ложь;
		Элементы.ДатаПо.Видимость = Ложь;
		
		Объект.Палата = Справочники.Палаты.ПустаяСсылка();
		Объект.КойкоМесто = Справочники.КойкоМеста.ПустаяСсылка();
		Объект.Подразделение = Справочники.Подразделения.ПустаяСсылка();
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыДвиженияВСтационаре.Поступление 
		Или Объект.ВидОперации = Перечисления.ВидыДвиженияВСтационаре.ИзменениеУсловий 
		Или Объект.ВидОперации = Перечисления.ВидыДвиженияВСтационаре.ПереводМеждуПодразделениями
	Тогда 
		Элементы.ГруппаПраво.Видимость	= Истина;
		Элементы.Полис.Видимость		= Истина;
		Элементы.ГруппаПалаты.Видимость = Истина;
		Элементы.Номенклатура.Видимость = Истина;
		Элементы.ВремяПо.Видимость = Истина;
		Элементы.ДатаПо.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ДокументОснование.Видимость = Объект.ВидОперации = Перечисления.ВидыДвиженияВСтационаре.Поступление;
	Элементы.ФормаЗаполнитьПоПредыдущему.Доступность = Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыДвиженияВСтационаре.Выписка");

КонецПроцедуры

&НаСервере
Функция ПолучитьПалатуПоПациенту(Клиент)
	//
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	КлиентыСтационараСрезПоследних.ПалатаПребывания
	//                      |ИЗ
	//                      |	РегистрСведений.КлиентыСтационара.СрезПоследних(&ДатаДокумента, Клиент = &Клиент) КАК КлиентыСтационараСрезПоследних");
	//Запрос.УстановитьПараметр("ДатаДокумента",Объект.Дата);						  
	//Запрос.УстановитьПараметр("Клиент",Клиент);
	//
	//Палата = Запрос.Выполнить().Выбрать().Следующий();
	//
	//Если Палата = Неопределено Тогда 
	//	Возврат Справочники.Палаты.ПустаяСсылка();
	//Иначе 
	//	Возврат Палата;
	//КонецЕсли;
	//
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТарифыПоВидуПалатыНаКлиенте(Объект)
	
	ОбъектКопия = Объект;
	ЗаполнитьТарифыПоВидуПалаты(ОбъектКопия);
	КопироватьДанныеФормы(ОбъектКопия, Объект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьТарифыПоВидуПалаты(Объект)
	
	Документы.УстановкаУсловийПребывания.ЗаполнитьТарифыПоВидуПалаты(Объект); // Неприменимо ОбщегоНазначенияСервер.ПроцедураМенеджера() - Знач.
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПолисаПрейскуранта()
	Элементы.Прейкурант.Доступность = Объект.Полис.Пустая();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоПредыдущемуНаСервере()

	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	УстановкаУсловийПребывания.Палата КАК Палата,
	                      |	УстановкаУсловийПребывания.Полис КАК Полис,
	                      |	УстановкаУсловийПребывания.КойкоМесто КАК КойкоМесто,
	                      |	УстановкаУсловийПребывания.ДатаНачала КАК ДатаНачала,
	                      |	УстановкаУсловийПребывания.ДатаОкончания КАК ДатаОкончания,
	                      |	УстановкаУсловийПребывания.Номенклатура.(
	                      |		Ссылка КАК Ссылка,
	                      |		НомерСтроки КАК НомерСтроки,
	                      |		Номенклатура КАК Номенклатура
	                      |	) КАК Номенклатура,
	                      |	УстановкаУсловийПребывания.Подразделение КАК Подразделение
	                      |ИЗ
	                      |	Документ.УстановкаУсловийПребывания КАК УстановкаУсловийПребывания
	                      |ГДЕ
	                      |	УстановкаУсловийПребывания.Ссылка <> &Ссылка
	                      |	И УстановкаУсловийПребывания.Проведен
	                      |	И УстановкаУсловийПребывания.ВидОперации <> &ВидОперации
	                      |	И УстановкаУсловийПребывания.Филиал = &Филиал
	                      |	И УстановкаУсловийПребывания.Клиент = &Клиент
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	УстановкаУсловийПребывания.МоментВремени УБЫВ");
						  
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыДвиженияВСтационаре.Выписка);
	Запрос.УстановитьПараметр("Филиал",Объект.Филиал);
	Запрос.УстановитьПараметр("Клиент",Объект.Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Объект.Подразделение	= Выборка.Подразделение;
		Объект.Палата			= Выборка.Палата;
		Объект.КойкоМесто	    = Выборка.КойкоМесто;
		Объект.ДатаНачала 		=  Выборка.ДатаНачала;
		Объект.ДатаОкончания	=  Выборка.ДатаОкончания;
		Объект.Полис			=  Выборка.Полис;
		
		ВыборкаДетали = Выборка.Номенклатура.Выбрать();
		
		Если ВыборкаДетали.Следующий() Тогда 
			Объект.Номенклатура.Очистить();
		КонецЕсли;
		ВыборкаДетали.Сбросить();
		
		Пока ВыборкаДетали.Следующий() Цикл 
			ЗаполнитьЗначенияСвойств(Объект.Номенклатура.Добавить(), ВыборкаДетали);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьДатуНачалаДействия(ТекущаяДатаНачала, ДатаДокумента, ДокументОбращения)
	
	Если ЗначениеЗаполнено(ТекущаяДатаНачала) Тогда
		Возврат ТекущаяДатаНачала;
	ИначеЕсли ЗначениеЗаполнено(ДокументОбращения) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбращения, "ДатаВремяПоступления");
	Иначе
		Возврат ДатаДокумента;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущийДокументОбращенияКлиента(Клиент)
	
	МедКарта = Стационар.ПолучитьМедКартуСтационара(Клиент);
	Возврат Стационар.ОбращениеПоМедкарте(Медкарта);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВладельцевКойки(Койка)
	
	СтруктураВозврата = Новый Структура;
	
	СтруктураВозврата.Вставить("Владелец", Койка.Владелец);
	СтруктураВозврата.Вставить("Подразделение", Койка.Владелец.Подразделение);
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПодразделениеКлиента(Клиент, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КлиентыСтационараСрезПоследних.Клиент КАК Клиент,
	               |	КлиентыСтационараСрезПоследних.Подразделение КАК Подразделение
	               |ИЗ
	               |	РегистрСведений.КлиентыСтационара.СрезПоследних(&Период, Клиент = &Клиент) КАК КлиентыСтационараСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Период", Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Подразделение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура НастроитьПодразделениеПоВидуДокумента(Перезаписывать = Ложь)

	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДвиженияВСтационаре.Поступление") Тогда
		Если Перезаписывать Тогда
			Если ЗначениеЗаполнено(Объект.ДокументОбращения) Тогда
				Объект.Подразделение = Объект.ДокументОбращения.Подразделение;
			ИначеЕсли ЗначениеЗаполнено(Объект.Палата) Тогда
				Объект.Подразделение = Объект.Палата.Подразделение;
			КонецЕсли;
		КонецЕсли;
		Элементы.Подразделение.Доступность = Не ЗначениеЗаполнено(Объект.ДокументОбращения) И Не ЗначениеЗаполнено(Объект.Палата);
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДвиженияВСтационаре.ИзменениеУсловий") Тогда
		Если ЗначениеЗаполнено(Объект.Клиент) Тогда
			Объект.Подразделение = ПолучитьПодразделениеКлиента(Объект.Клиент, Объект.ДатаНачала);	
		КонецЕсли;
		Элементы.Подразделение.Доступность = Ложь;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДвиженияВСтационаре.ПереводМеждуПодразделениями") Тогда
		Элементы.Подразделение.Доступность = Истина;	
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВремяПриИзменении()
	
	Объект.ДатаНачала = ДатаС + (ВремяС - Дата(1,1,1));
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДвиженияВСтационаре.ИзменениеУсловий") Тогда
		Объект.Подразделение = ПолучитьПодразделениеКлиента(Объект.Клиент, Объект.ДатаНачала);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
